# IFC_GetIFCEntity

## Description
Gets IFC entity type

```pascal
FUNCTION IFC_GetIFCEntity(
				hObject        : HANDLE;
				VAR outStrName : STRING) : BOOLEAN;
```

```python

def vs.IFC_GetIFCEntity(hObject):
    return (BOOLEAN, outStrName)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|outStrName|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* IFC